app/Http/Controllers/HomeController.php

select sum(`pay`) as aggregate from `orders` where `order_date` = '12/09/2022'
select sum(`due`) as aggregate from `orders` where `order_date` = '12/09/2022'
---
    public function index()
    {
        $todaySells=DB::table('orders')
        ->join('customers', 'orders.customer_id', 'customers.id')
        ->where('orders.order_date', date('d/m/Y'))
        ->select('customers.name', 'orders.*')
        ->orderBy('orders.id', 'desc')
        ->toSql();
        $todayIncome = DB::table('orders')->where('order_date', date('d/m/Y'))->sum('pay');
        $todayDue = DB::table('orders')->where('order_date', date('d/m/Y'))->sum('due');