app/Http/Controllers/HomeController.php

    public function index(Request $request)
    {
        $filter = $request->query('filter');
        $filtersearch = Product::all();
        if (!empty($filter)) {
            $filtersearch = $filtersearch->where('product_name', 'like', '%'.$filter.'%');

        }
        //dd($filtersearch);
        $products=Pos::all();
        $customers=Customer::all();
        $categories = Category::all();
        $vats = DB::table('extra')->first();
        $catProducts = DB::table('products')
        ->join('categories', 'products.category_id', 'categories.id')
        ->select('products.id','products.product_name', 'products.selling_price', 'products.product_quantity')
        ->get();
        $expenses = DB::table('expenses')->where('expense_date', date('Y-m-d'))->sum('amount');

        $stockOutProducts= DB::table('products')->where('product_quantity', '=', 0)->get();  $filter = $request->query('filter');
        $filtersearch = Product::all();
        if (!empty($filter)) {
            $filtersearch = $filtersearch->where('product_name', 'like', '%'.$filter.'%');

        }
        //dd($filtersearch);
        $products=Pos::all();
        $customers=Customer::all();
        $categories = Category::all();
        $vats = DB::table('extra')->first();
        $catProducts = DB::table('products')
        ->join('categories', 'products.category_id', 'categories.id')
        ->select('products.id','products.product_name', 'products.selling_price', 'products.product_quantity')
        ->get();
        $expenses = DB::table('expenses')->where('expense_date', date('Y-m-d'))->sum('amount');

        $stockOutProducts= DB::table('products')->where('product_quantity', '=', 0)->get();

        $todaySells=Order::where('orders.order_date', date('d/m/Y'))
        ->count();


        $todayIncome = DB::table('orders')->where('order_date', date('d/m/Y'))->sum('pay');
        $todayDue = DB::table('orders')->where('order_date', date('d/m/Y'))->sum('due');
        $expenses = DB::table('expenses')->where('expense_date', date('Y-m-d'))->sum('amount');

        $stockOutProducts= DB::table('products')->where('product_quantity', '=', 0)->get();
---
select * from `products`
select * from `customers`
select * from `categories`
select * from `extra` limit 1
select `products`.`id`, `products`.`product_name`, `products`.`selling_price`, `products`.`product_quantity` from `products` inner join `categories` on `products`.`category_id` = `categories`.`id`
select sum(`amount`) as aggregate from `expenses` where `expense_date` = '2022-09-12'
select * from `products` where `product_quantity` = 0
select count(*) as aggregate from `orders` where `orders`.`order_date` = '12/09/2022'
select sum(`pay`) as aggregate from `orders` where `order_date` = '12/09/2022'
select sum(`due`) as aggregate from `orders` where `order_date` = '12/09/2022'