app/Http/Controllers/ProductController.php

select `products`.*, `categories`.`category_name`, `suppliers`.`name` from `products` inner join `categories` on `products`.`category_id` = `categories`.`id` inner join `suppliers` on `products`.`supplier_id` = `suppliers`.`id` order by `products`.`id` desc
---
    public function index()
    {
        $products = Product::select('products.product_name', 'products.selling_price','products.night_price', 'products.buying_price', 'categories.category_name', 'suppliers.name', 'products.product_quantity', 'products.id')
        ->join('categories', 'categories.id', '=', 'products.category_id')
        ->join('suppliers', 'suppliers.id', '=', 'products.supplier_id')
        ->paginate();